app/Controllers/Usuarios.php

    public function index(){

        return view('usuarios', [
            'usuarios' => $this->usuarioModel->findAll()
        ]);
---
SELECT *
FROM `usuarios`

    public function delete($id){
        if($this->usuarioModel->delete($id)){
---
DELETE FROM `usuarios`
WHERE `id` IN ('7')

    public function edit($id){

        return view('form',['messages' => "Editar Usuário",'usuarios' => $this->usuarioModel->find($id)]);
---
SELECT *
FROM `usuarios`
WHERE `usuarios`.`id` = '7'